<template>
  <Header title="리뷰 관리" />
  <!-- 임시로 데이터 불러오는 역할-->
  <ReviewList :reviews="reviewsData[0].reviews" />
</template>

<script>
import Header from "@/components/admin/layout/Header.vue";
import ReviewList from "@/components/admin/review/ReviewItem.vue";


export default {
  data() {
    return {
      reviewsData: [
        {
          id: 1,
          name: "인쌩맥주",
          reviews: [
            {
              id: 101,
              member: {
                id: 201,
                name: "User123",
                profilePicture: "https://via.placeholder.com/150", // 프로필 사진
              },
              rating: 4.2,
              content:
                "훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!훌륭한 판단의 표본이로군!",
              createdTime: "2024-10-01",
            },
            {
              id: 102,
              member: {
                id: 202,
                name: "맛있으면짖는개",
                profilePicture: "https://via.placeholder.com/150", // 프로필 사진
              },
              rating: 3.8,
              content: "야옹야옹야옹.",
              createdTime: "2024-09-29",
            },
          ],
        },
      ],
    };
  },
  components: {
    Header,
    ReviewList,
  },
};
</script>

<style></style>
